#include <iostream>

int main() {
  float f = 1.0;
  char x = *((char*)&f + 2);
  std::cout << "x: " << x << std::endl;
}

/**
В этом коде переменная f типа float инициализируется значением 1.0. 
Затем с помощью операции *((char *)&f + 2) происходит доступ к третьему байту 
(порядок байт в памяти может зависеть от архитектуры компьютера) значения f.

В данном случае, результат зависит от конкретной архитектуры компьютера и спецификации языка, 
и, возможно, может быть несовместимым с некоторыми стандартами языка C++. 
Однако, если взять стандартные архитектуры, где float представляется в формате IEEE 754 
(обычный формат для чисел с плавающей запятой), то третий байт будет представлять экспоненту числа.

Поэтому результат будет зависеть от конкретной архитектуры, но в большинстве случаев 
x будет содержать один из байтов экспоненты числа f.
*/