Repository: tnsoftbear/study-coding
Catalog: flutter/currency_calc/lib/l10n/all_*.arb
Languages: ru

# aboutContent
source: This application can convert currencies. It is study project for learning Flutter and Dart. See source code and description at https://github.com/tnsoftbear/study-coding/tree/master/flutter/currency_calc (c) github.com/tnsoftbear
ru: Это приложение умеет ковретировать валюты. Это проект для изучения Flutter и Dart. Смотрите исходный код и описание по адресу: https://github.com/tnsoftbear/study-coding/tree/master/flutter/currency_calc (c) github.com/tnsoftbear

# aboutTitle
source: About
ru: О приложении

# appTitle
source: Currency Converter (c) github.com/tnsoftbear
ru: Калькулятор валют (с) github.com/tnsoftbear

# conversionCalculationResult
source: Result: {targetAmount}
ru: Результат: {targetAmount}

# conversionEnterAmount
source: Enter amount
ru: Введите сумму

# conversionHistoryActionsColumnTooltip
source: Actions
ru: Действия

# conversionHistoryDateColumnTitle
source: Date
ru: Дата

# conversionHistoryDateColumnTooltip
source: Date of calculation
ru: Дата на момент подсчёта

# conversionHistoryRateColumnTitle
source: Rate
ru: Курс

# conversionHistoryRateColumnTooltip
source: Rate at the moment of calculation
ru: Курс на момент подсчёта

# conversionHistorySourceColumnTitle
source: From
ru: Из

# conversionHistorySourceColumnTooltip
source: Source currency
ru: Исходная валюта

# conversionHistoryTargetColumnTitle
source: To
ru: В

# conversionHistoryTargetColumnTooltip
source: Target currency
ru: Целевая валюта

# conversionRateResult
source: {sourceCurrency} to {targetCurrency} rate: {rate}
ru: Курс из {sourceCurrency} в {targetCurrency}: {rate}

# conversionTitle
source: Currency Calculator
ru: Калькулятор валют

# conversionValidationErrSourceAmountNotNumeric
source: Source amount is not numeric
ru: Исходное значение должно быть числом

# conversionValidationErrSourceAmountNotPositive
source: Source amount must be positive
ru: Исходное значение должно быть положительным числом

# conversionValidationErrSourceAndTargetCurrencySame
source: Source and target currencies cannot be the same
ru: Исходная и целевая валюты не могут быть одинаковыми

# conversionValidationErrSourceCurrencyInvalid
source: Source currency is invalid
ru: Исходная валюта неправильная

# conversionValidationErrTargetCurrencyInvalid
source: Target currency is invalid
ru: Целевая валюта неправильная

# settingSelectLanguage
source: Select language:
ru: Выберите язык:

# settingTitle
source: Settings
ru: Настройки
